CargomartExtension/src/Documents/КМ_Заказ/КМ_Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КМ_Заказ</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.КМ_СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>Поле &quot;vatRate&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСНДС</name>
    <comment>Поле &quot;price&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипГрузовика</name>
    <comment>поле &quot;truckTypeId&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТоннажАвто</name>
    <comment>Поле &quot;cargoWeight&quot;, в тоннах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КубатураАвто</name>
    <comment>Поле &quot;cargoCapacity&quot;, в м3</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесГруза</name>
    <comment>Поле &quot;loadWeight&quot;, в тоннах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемГруза</name>
    <comment>Поле &quot;loadCapacity&quot;, в м3</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеГруза</name>
    <comment>Поле &quot;cargoType&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураОт</name>
    <comment>Поле &quot;temperature -> form&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураДо</name>
    <comment>Поле &quot;temperature -> to&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПогрузкиРазгрузки</name>
    <comment>Поле &quot;loading&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопОборудованиеМашины</name>
    <comment>Поле &quot;device&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПеревозки</name>
    <comment>Поле &quot;conditions&quot;</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПоОплате</name>
    <comment>Поле &quot;paymentDetail&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метки</name>
    <comment>Поле &quot;tag&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтратегияЗаданияЦены</name>
    <comment>Поле &quot;priceStrategyType&quot;, [ fixedPrice, cmPrice ]</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаказа</name>
    <comment>Поле &quot;biddingType&quot;, [ auction, express ]</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагИзмененияЦеныЗаказа</name>
    <comment>Поле &quot;bidding->stepBid&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДатаТоргов</name>
    <comment>Поле &quot;bidding->endDate&quot;</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УИДЧерновика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИДЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПеревозкиДополнительно</name>
    <comment>Поле &quot;carriageDetail&quot;</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДетальнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршрут</name>
    <attributes>
      <name>ПунктПогрузкиВыгрузки</name>
      <comment>поле &quot;storage&quot;</comment>
      <type>
        <types>CatalogRef.КМ_ПунктыПогрузкиВыгрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМаршрутнойТочки</name>
      <comment>поле &quot;type&quot;, 1 = &quot;load&quot;, 2 = &quot;unload&quot;, 3 = &quot;loadUnload&quot;</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>поле &quot;additionalInfo&quot;</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаМаршрутнойТочки</name>
      <comment>поле &quot;fromDate&quot;</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяС</name>
      <comment>поле &quot;fromTime&quot;</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПо</name>
      <comment>поле &quot;toTime&quot;</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контакты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.КМ_Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

CargomartExtension/src/Enums/КМ_СтатусыЗаказов/КМ_СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КМ_СтатусыЗаказов</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Опубликован</name>
  </enumValues>
  <enumValues>
    <name>ВТоргах</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаПослеТоргов</name>
  </enumValues>
  <enumValues>
    <name>Исполняется</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Архивный</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
</mdclass:Enum>

CargomartExtension/src/Documents/КМ_Заказ/ManagerModule.bsl
Процедура ЗаполнитьЗначенияПоУмолчанию(ОбъектЗаказ) Экспорт
	
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	ПеречислениеСсылкаСтавкиНДС = КМ_ОбщийМодульПовтИсп.МодульЯдро().ПолучитьСсылкиНаОбъектыКонфигурации("Перечисления_СтавкиНДС");
	
	ОбъектЗаказ.Организация 			= БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");	
	ОбъектЗаказ.СтавкаНДС 				= ПеречислениеСсылкаСтавкиНДС.НДС20;
	
#КонецЕсли

	ОбъектЗаказ.Статус 					= Перечисления.КМ_СтатусыЗаказов.Черновик;
	ОбъектЗаказ.ТипГрузовика 			= 5; //Тент
	ОбъектЗаказ.ТоннажАвто 				= 10;
	ОбъектЗаказ.КубатураАвто 			= 20;
	ОбъектЗаказ.ВесГруза 				= 5;
	ОбъектЗаказ.ОбъемГруза 				= 15;
	ОбъектЗаказ.ТемператураОт 			= 0;
	ОбъектЗаказ.ТемператураДо 			= 40;
	ОбъектЗаказ.ТипПогрузкиРазгрузки 	= 4;
	ОбъектЗаказ.СтратегияЗаданияЦены 	= "fixedPrice";
	ОбъектЗаказ.ТипЗаказа 				= "auction";
	ОбъектЗаказ.ШагИзмененияЦеныЗаказа 	= 500;
	ОбъектЗаказ.КонечнаяДатаТоргов 		= НачалоДня(ТекущаяДата() + 3 * КМ_ОбщийМодульКлиентСервер.Сутки());
	 
КонецПроцедуры
